PAGINATION_LEXICON = {
    'incidents_left': '⬅️', 'incidents_right': '➡️',
    'users_left': '⬅️', 'users_right': '➡️'
}

FILTER_LEXICON = {
    'date_sorting': {
        'newest_first': '🕗 Сначала новые',
        'oldest_first': '🕗 Сначала старые',
    },
    'severity_filter': {
        'default_severity': '❗Уровень угрозы (без фильтра)',
        'high_severity': '🔴 Высокий',
        'medium_severity': '🟠 Средний',
        'low_severity': '🟡 Низкий'
    },
    'status_filter': {
        'default_status': '📋 Статус (без фильтра)',
        'new_status': '📋 Новый',
        'approved_status': '📋 Утверждён',
        'in_progress_status': '📋 В работе',
        'resolved_status': '📋 Разрешён',
        'closed_status': '📋 Закрыт'
    }
}

INCIDENTS_LEXICON = {
    'filter_menu': '<b>Сортировка по:</b>\n\n'
                   '<b>Дата создания</b>\n'
                   '➖ Сначала новые\n'
                   '➖ Сначала старые\n'
                   '<b>Уровень угрозы</b>\n'
                   '➖ Высокий\n'
                   '➖ Средний\n'
                   '➖ Низкий\n'
                   '<b>Статус инцидента</b>\n'
                   '➖ Новый\n'
                   '➖ Утверждён\n'
                   '➖ В работе\n'
                   '➖ Разрешён\n'
                   '➖ Закрыт',
    'enter_id_key': 'Введите идентификатор/ключ инцидента для получения информации.',
    'incorrect_id_key': 'Инцидент не найден. Возможно введён некорректный id/ключ.\n\n'
                        'Попробуйте ещё раз или напишите\n'
                        '/cancel, чтобы отменить операцию.'
}